# macOS package list — installed via `scripts/install-mac.sh`.
# Run `brew bundle dump --file=scripts/Brewfile --force` to regenerate
# from currently-installed packages.

# Shell: prompt, plugins, smart cd
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "fzf-tab"
brew "zoxide"
brew "fzf"

# Modern CLI tools
brew "eza"
brew "fd"             # fast `find` replacement; required by snacks.nvim projects picker

# Terminal multiplexers (using both for now)
brew "tmux"
brew "zellij"

# Dev tooling
brew "mise"
brew "gh"
brew "git"
brew "chezmoi"        # dotfiles manager (this very repo)
brew "jq"             # required by jackknife setup.sh
brew "lazygit"
brew "lazydocker"

# Multi-agent workflow stack (jackknife-related)
brew "dicklesworthstone/tap/ntm"
brew "dicklesworthstone/tap/bv"   # beads viewer (paired with `br`)

# Editors
brew "neovim"

# Terminal emulator
cask "ghostty"

# GUI editors
cask "zed"
